---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.UnsatisfiedSupportAssocProp
source: html/36461906-d531-d9cc-4d1c-6ade2f9ca6b6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.UnsatisfiedSupportAssocProp Property

Constraint between a Line created with Pick Support and the Support is not satisfied.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnsatisfiedSupportAssocProp { get; }
```